#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation ``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azuread_application.proxmox[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_application" "proxmox" {
      [32m+[0m [0m[1m[0mapp_role_ids[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mapplication_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdisabled_by_microsoft[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                = "Proxmox VE"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlogo_url[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0moauth2_permission_scope_ids[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mprevent_duplicate_names[0m[0m     = false
      [32m+[0m [0m[1m[0mpublisher_domain[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msign_in_audience[0m[0m            = "AzureADMyOrg"
      [32m+[0m [0m[1m[0mtags[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtemplate_id[0m[0m                 = (known after apply)

      [32m+[0m [0mapi {
          [32m+[0m [0m[1m[0mrequested_access_token_version[0m[0m = 2
        }

      [32m+[0m [0mfeature_tags {
          [32m+[0m [0m[1m[0mcustom_single_sign_on[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menterprise[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mgallery[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhide[0m[0m                  = (known after apply)
        }

      [32m+[0m [0mrequired_resource_access {
          [32m+[0m [0m[1m[0mresource_app_id[0m[0m = "00000003-0000-0000-c000-000000000000"

          [32m+[0m [0mresource_access {
              [32m+[0m [0m[1m[0mid[0m[0m   = "37f7f235-527c-4136-accd-4a02d197296e"
              [32m+[0m [0m[1m[0mtype[0m[0m = "Scope"
            }
          [32m+[0m [0mresource_access {
              [32m+[0m [0m[1m[0mid[0m[0m   = "7427e0e9-2fba-42fe-b0c0-848c9e6a8182"
              [32m+[0m [0m[1m[0mtype[0m[0m = "Scope"
            }
        }

      [32m+[0m [0mweb {
          [32m+[0m [0m[1m[0mredirect_uris[0m[0m = [
              [32m+[0m [0m"https://pve.homecentr.one/",
              [32m+[0m [0m"https://pve1.homecentr.one/",
              [32m+[0m [0m"https://pve2.homecentr.one/",
              [32m+[0m [0m"https://pve3.homecentr.one/",
            ]
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lholota, Action: `pull_request`*